project_1_routes/app/controllers/artworks_controller.rb

  def create
    artwork = Artwork.new(artwork_params)
    # debugger
    if artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Circles"], ["image_url", "art.com/circles"], ["artist_id", 1], ["created_at", "2020-01-02 16:28:48.885812"], ["updated_at", "2020-01-02 16:28:48.885812"]]

  def destroy
    artwork = Artwork.find_by(id: params[:id])
    artwork.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 4]]