project_1_routes/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 6], ["viewer_id", 3], ["created_at", "2020-01-02 17:09:15.825569"], ["updated_at", "2020-01-02 17:09:15.825569"]]
---
  def create
    shares = ArtworkShare.new(artwork_share_params)

    if shares.save