project_1_routes/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."author_id" = $1  [["author_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 1]]
SELECT "comments".* FROM "comments"
---
    def index
      # debugger
      if params[:author_id]
          render json: Comment.where(author_id: params[:author_id])
      elsif params[:artwork_id]
          render json: Comment.where(artwork_id: params[:artwork_id])
      else
        render json: Comment.all

INSERT INTO "comments" ("author_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 4], ["artwork_id", 1], ["body", "Looks good"], ["created_at", "2020-01-02 20:26:45.442535"], ["updated_at", "2020-01-02 20:26:45.442535"]]
---
    def create
      comment = Comment.new(comment_params)

      if comment.save