project_1_routes/app/controllers/users_controller.rb

  def index
    # render plain: "I'm in the index action!"
    if params[:username]
      render json: User.where("username ILIKE \'#{params[:username]}%\'")
    else
      render json: User.all
---
SELECT "users".* FROM "users" WHERE (username ILIKE 'bob%')
SELECT "users".* FROM "users"

  def update
    user = User.find(params[:id])
    # debugger
    # user_params = params.require(:user).permit(:name, :email)
    if
      user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "adam@gmail.com"], ["updated_at", "2019-12-31 20:41:26.678550"], ["id", 3]]